# ClearOverrides Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerParameterManager..::..ClearOverrides Method
RebarContainerParameterManager Class See Also
---
Clears any overridden values from all parameters of the associated RebarContainer element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void ClearOverrides()
```

Visual Basic
---
```text
Public Sub ClearOverrides
```

Visual C++
---
```text
public:
void ClearOverrides()
```

# See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace